# Ultralytics YOLO 🚀, AGPL-3.0 license
# Custom YOLOv8 lightweight + ECAAttention model
# Optimized for speed and accuracy balance

# Parameters
nc: 2  # number of classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]  # nano
  s: [0.33, 0.50, 1024]  # small
  m: [0.67, 0.75, 768]   # medium
  l: [1.00, 1.00, 512]   # large
  x: [1.00, 1.25, 512]   # xlarge

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C3Ghost, [128]]          # lightweight ghost block
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C3Ghost, [256]]
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C3Ghost, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C3Ghost, [1024]]
  - [-1, 1, SPPF, [1024, 5]]         # 9 - spatial pyramid pooling

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]        # cat backbone P4
  - [-1, 3, C2f, [512]]              # 12
  - [-1, 1, ECAAttention, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]        # cat backbone P3
  - [-1, 3, C2f, [256]]              # 16 (P3/8-small)
  - [-1, 1, ECAAttention, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]       # cat head P4
  - [-1, 3, C2f, [512]]              # 20 (P4/16-medium)
  - [-1, 1, ECAAttention, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]        # cat head P5
  - [-1, 3, C2f, [1024]]             # 24 (P5/32-large)
  - [-1, 1, ECAAttention, [1024]]

  - [[17, 21, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
